presentations/intro-to/the-unix-commandline.org
#+TITLE: The Unix Commandline
#+OPTIONS: toc:nil reveal_width:1200 reveal_height:1080 num:nil
#+REVEAL_ROOT: ../reveal.js
#+REVEAL_TITLE_SLIDE: <h1>%t</h1><h3>%s</h3><h2>By %A %a</h2><h3><i>Your inner hacker will be released today</i></h3><p>Press s for speaker notes</p>
#+REVEAL_THEME: black
#+REVEAL_TRANS: slide

#+LATEX_CLASS: article
#+LATEX_CLASS_OPTIONS: [a4paper]
#+LATEX_HEADER: \usepackage[top=1cm,left=3cm,right=3cm]{geometry}

* What is the Unix commandline?
#+begin_notes
The unix commandline is an interpreter known as the shell and a set of tools that come together to
form a functional operating system. It is a central part of unix and for a very
long time the only way to interact with unix. Not only do you call a command but you can
chain them to form larger and more complex programs from simple building blocks.
This is called pipelining and will be discussed later
#+end_notes

* Why do I need to know the Unix command line?
#+begin_notes
It is a good skill to have for many reasons
- Linux is the biggest and largest form of Unix like OS used today and its used
  on most servers. If you ever need to ssh into a server to fix something and
  you don't know the basics then you will be F*ucked
- The commandline unlike in windows is much more direct and powerful. This means
  that a lot of guides in linux land will use it over a gui tool you may be used to
  - chaining commands together feels a lot more satisfying than /python/
    #+end_notes

* What do I need too know then?
** A little bit of syntax
*** Variables
#+begin_notes
Shell is not a very nice language so syntax is important
To set a variable you would set it like any other language but you can't have a
space between the variable symbol and the equals sign

To call it you need to prepend the $ sign

Environment variables are global variables to set them you need to prepend export

You can also asign the output of commands to variables
#+end_notes
#+begin_src shell
var="some value"
export ENVAR="some global value"

command_out=$(some command)
echo $var
echo $ENVAR
echo $command_out
#+end_src
*** flags
#+begin_notes
A flag is an optional argument provided to a command to provide it with some
sort of structured input or to tell it to do something they are usually denoted
with a - hyphen and a single letter or 2 hyphens and a word you can usually
string together multiple short form commands
#+end_notes

#+begin_src shell
command -l # short form flags
command -la # 2 short form flags
command --long # long form flags
command --input INPUT # example of input
#+end_src

* The main commands
#+begin_notes
These are all of the commands that are kind of essential. I don't expect you to
remember them all and this is not an exaustive list. This should give you a
starting place. That being said there are quite a few
#+end_notes
** Moving around
*** pwd
Prints the current directory
#+begin_notes
pwd prints the current working directory
It stands for print working directory
#+end_notes
#+begin_src bash
$ pwd
#+end_src
*** cd
change directory
#+begin_notes
Change the current directory

Some sybols that are helpful
~ which is a shortcut to your home dir
. is the current directory
.. is the previous directory
#+end_notes

#+begin_src bash
$ cd ~/your/directory
$ pwd
/home/$USER/your/directory
$ cd ~ # cd /home/$USER
$ pwd
/home/jeet
$ cd ..
$ pwd
/home
#+end_src

*** ls
list the current directory's contents
#+begin_src bash
$ ls
$ ls -a
$ ls -l
$ ls -la
#+end_src

#+begin_notes
The ls command lists the current directory
the -a flag will show hidden files (all files)
these are denoted with a dot infront of there name
the -l flag will list all files in the long format
#+end_notes
** Files
*** touch
#+begin_notes
touch is used to create an empty file. Its actually used to change the time
stamp on the file but thats not used as much. if at all

you have to provide the date in the disgusting order of month day year
#+end_notes

#+begin_src shell
$ touch file

$ touch existing-file -d month/day/year
#+end_src

*** mv
#+begin_notes
mv is used to move files around the filesystem. It takes the file to move and
the destination of that file. It is also used to rename a file

If you need to move directorys then you need to make sure that the names are
unique. mv will not move that file by default but if you provide the -f then you
will overwrite the previous directory
There also the -i flag that will ask you to confirm
#+end_notes

#+begin_src bash
$ mv SOURCE DESTINATION

$ ls
file1
$ mv file1 file2
$ ls
file2

$ ls
dir1 dir2
$ mv dir1 dir2
mv: cannot move 'dir1' ro 'dir2' : Directory not empy
$ mv dir1 dir2 -f
$ ls
dir2
#+end_src
*** cp
#+begin_notes
cp copys a file leaving the source file intact It can overwite the destination
file tho so be careful with your names you can use the -f and -i flag like you
would for mv
#+end_notes

#+begin_src bash
$ cp SOURCE DEST

$ ls
file1
$ cp file1 file2
$ ls
file1 file2
#+end_src
*** ln
#+begin_notes
ln creates a symbolic link between two files. a symbolic link is reference to
another file it does not actually copy the file and is very useful for a lot of
different senarios. some being storing files spread out over the file system in
a central location.

it take the arguments of source and destination and an optional flag -s which
makes the link soft. by default the symbolic link will not look like a link but
another file. if you want it to show up as a link you need to add the -s flag
#+end_notes
#+begin_src bash
$ ln source-file dest-file
$ ls -l
-rw-rw-r-- jeet jeet ... source-file
-rw-rw-r-- jeet jeet ... dest-file

$ ln source-file dest-file -s
$ ls -l
-rw-rw-r-- jeet jeet ... source-file
lrwxrwxrwx jeet jeet ... dest-file -> source-file
#+end_src
*** rm
#+begin_notes
delete a file. add the -i flag to ask for your confirmation. If you need to
delete a directory then you need to add the -r (recursive) flag and if the file
cannot be written to then you can use the -f option
#+end_notes

#+begin_src bash
$ rm file -i
rm: remove regular file 'file'? # your input here
# no more file
$ rm dir
rm: cannot remove 'dir' : Is a directory
$ rm dir -r
# all good
#+end_src

#+RESULTS:

*** mkdir
#+begin_notes
make a directory.. use the -p flag to make a lot of child directorys quickly
#+end_notes

#+begin_src bash
$ mkdir dir

$ mkdir dir1/dir2/dir2
mkdir: cannot create directory 'dir1/dir2/dir3': No such file or directory
$ mkdir dir1/dir2/dir2 -p
#+end_src
** Reading and writing files
*** cat
#+begin_notes
output and concatenate multiple files.
#+end_notes

#+begin_src shell
$ cat file
# contense of file
$ cat file1 file2
# contense of both files
#+end_src
*** head
#+begin_notes
Output the first 10 lines of a file
the -n flag allows you to specify the amount of lines you want to print out
#+end_notes

#+begin_src shell
$ head file -n 20
#+end_src
*** tail
#+begin_notes
Same as head but for the last 10 lines
again -n will allow you to specify the amount of lines
#+end_notes

#+begin_src bash
$ tail file -n 20
#+end_src
