presentations/intro-to/the-unix-commandline.tex
% Created 2021-05-27 Thu 03:04
% Intended LaTeX compiler: pdflatex
\documentclass[a4paper]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[top=1cm,left=3cm,right=3cm]{geometry}
\author{Jeetaditya Chatterjee}
\date{\today}
\title{The Unix Commandline}
\hypersetup{
	pdfauthor={Jeetaditya Chatterjee},
	pdftitle={The Unix Commandline},
	pdfkeywords={},
	pdfsubject={},
	pdfcreator={Emacs 28.0.50 (Org mode 9.5)},
	pdflang={English}}
\begin{document}

\maketitle

\section*{What is the Unix commandline?}
\label{sec:orge4c6621}
\begin{notes}
	The unix commandline is an interpreter known as the shell and a set of tools that come together to
	form a functional operating system. It is a central part of unix and for a very
	long time the only way to interact with unix. Not only do you call a command but you can
	chain them to form larger and more complex programs from simple building blocks.
	This is called pipelining and will be discussed later
\end{notes}

\section*{Why do I need to know the Unix command line?}
\label{sec:orgcf02e17}
\begin{notes}
	It is a good skill to have for many reasons
	\begin{itemize}
		\item Linux is the biggest and largest form of Unix like OS used today and its used
		      on most servers. If you ever need to ssh into a server to fix something and
		      you don't know the basics then you will be F*ucked
		\item The commandline unlike in windows is much more direct and powerful. This means
		      that a lot of guides in linux land will use it over a gui tool you may be used to
		      \begin{itemize}
			      \item chaining commands together feels a lot more satisfying than \emph{python}
		      \end{itemize}
	\end{itemize}
\end{notes}

\section*{What do I need too know then?}
\label{sec:org6a91b3b}
\subsection*{A little bit of syntax}
\label{sec:org9bddc09}
\subsubsection*{Variables}
\label{sec:orgdb870cc}
\begin{notes}
	Shell is not a very nice language so syntax is important
	To set a variable you would set it like any other language but you can't have a
	space between the variable symbol and the equals sign

	To call it you need to prepend the \$ sign

	Environment variables are global variables to set them you need to prepend export

	You can also asign the output of commands to variables
\end{notes}
\begin{verbatim}
var="some value"
export ENVAR="some global value"

command_out=$(some command)
echo $var
echo $ENVAR
echo $command_out
\end{verbatim}
\subsubsection*{flags}
\label{sec:orge36456b}
\begin{notes}
	A flag is an optional argument provided to a command to provide it with some
	sort of structured input or to tell it to do something they are usually denoted
	with a - hyphen and a single letter or 2 hyphens and a word you can usually
	string together multiple short form commands
\end{notes}

\begin{verbatim}
command -l # short form flags
command -la # 2 short form flags
command --long # long form flags
command --input INPUT # example of input
\end{verbatim}

\section*{The main commands}
\label{sec:orgeb1bf18}
\begin{notes}
	These are all of the commands that are kind of essential. I don't expect you to
	remember them all and this is not an exaustive list. This should give you a
	starting place. That being said there are quite a few
\end{notes}
\subsection*{Moving around}
\label{sec:org08c2231}
\subsubsection*{pwd}
\label{sec:orge814c84}
Prints the current directory
\begin{notes}
	pwd prints the current working directory
	It stands for print working directory
\end{notes}
\begin{verbatim}
$ pwd
\end{verbatim}
\subsubsection*{cd}
\label{sec:org5142c60}
change directory
\begin{notes}
	Change the current directory

	Some sybols that are helpful
	\textasciitilde{} which is a shortcut to your home dir
	. is the current directory
	.. is the previous directory
\end{notes}

\begin{verbatim}
$ cd ~/your/directory
$ pwd
/home/$USER/your/directory
$ cd ~ # cd /home/$USER
$ pwd
/home/jeet
$ cd ..
$ pwd
/home
\end{verbatim}

\subsubsection*{ls}
\label{sec:org4d2b9af}
list the current directory's contents
\begin{verbatim}
$ ls
$ ls -a
$ ls -l
$ ls -la
\end{verbatim}

\begin{notes}
	The ls command lists the current directory
	the -a flag will show hidden files (all files)
	these are denoted with a dot infront of there name
	the -l flag will list all files in the long format
\end{notes}
\subsection*{Files}
\label{sec:org2b3e2c6}
\subsubsection*{touch}
\label{sec:org281b4f8}
\begin{notes}
	touch is used to create an empty file. Its actually used to change the time
	stamp on the file but thats not used as much. if at all

	you have to provide the date in the disgusting order of month day year
\end{notes}

\begin{verbatim}
$ touch file

$ touch existing-file -d month/day/year
\end{verbatim}

\subsubsection*{mv}
\label{sec:org147eb5c}
\begin{notes}
	mv is used to move files around the filesystem. It takes the file to move and
	the destination of that file. It is also used to rename a file

	If you need to move directorys then you need to make sure that the names are
	unique. mv will not move that file by default but if you provide the -f then you
	will overwrite the previous directory
	There also the -i flag that will ask you to confirm
\end{notes}

\begin{verbatim}
$ mv SOURCE DESTINATION

$ ls
file1
$ mv file1 file2
$ ls
file2

$ ls
dir1 dir2
$ mv dir1 dir2
mv: cannot move 'dir1' ro 'dir2' : Directory not empy
$ mv dir1 dir2 -f
$ ls
dir2
\end{verbatim}
\subsubsection*{cp}
\label{sec:orgee3f4c1}
\begin{notes}
	cp copys a file leaving the source file intact It can overwite the destination
	file tho so be careful with your names you can use the -f and -i flag like you
	would for mv
\end{notes}

\begin{verbatim}
$ cp SOURCE DEST

$ ls
file1
$ cp file1 file2
$ ls
file1 file2
\end{verbatim}
\subsubsection*{ln}
\label{sec:org3883214}
\begin{notes}
	ln creates a symbolic link between two files. a symbolic link is reference to
	another file it does not actually copy the file and is very useful for a lot of
	different senarios. some being storing files spread out over the file system in
	a central location.

	it take the arguments of source and destination and an optional flag -s which
	makes the link soft. by default the symbolic link will not look like a link but
	another file. if you want it to show up as a link you need to add the -s flag
\end{notes}
\begin{verbatim}
$ ln source-file dest-file
$ ls -l
-rw-rw-r-- jeet jeet ... source-file
-rw-rw-r-- jeet jeet ... dest-file

$ ln source-file dest-file -s
$ ls -l
-rw-rw-r-- jeet jeet ... source-file
lrwxrwxrwx jeet jeet ... dest-file -> source-file
\end{verbatim}
\subsubsection*{rm}
\label{sec:org6ff3a26}
\begin{notes}
	delete a file. add the -i flag to ask for your confirmation. If you need to
	delete a directory then you need to add the -r (recursive) flag and if the file
	cannot be written to then you can use the -f option
\end{notes}

\begin{verbatim}
$ rm file -i
rm: remove regular file 'file'? # your input here
# no more file
$ rm dir
rm: cannot remove 'dir' : Is a directory
$ rm dir -r
# all good
\end{verbatim}

\subsubsection*{mkdir}
\label{sec:org9cd4f19}
\begin{notes}
	make a directory.. use the -p flag to make a lot of child directorys quickly
\end{notes}

\begin{verbatim}
$ mkdir dir

$ mkdir dir1/dir2/dir2
mkdir: cannot create directory 'dir1/dir2/dir3': No such file or directory
$ mkdir dir1/dir2/dir2 -p
\end{verbatim}
\subsection*{Reading and writing files}
\label{sec:org7628cc0}
\subsubsection*{cat}
\label{sec:org41b191a}
\begin{notes}
	output and concatenate multiple files.
\end{notes}

\begin{verbatim}
$ cat file
# contense of file
$ cat file1 file2
# contense of both files
\end{verbatim}
\subsubsection*{head}
\label{sec:org2138524}
\begin{notes}
	Output the first 10 lines of a file
	the -n flag allows you to specify the amount of lines you want to print out
\end{notes}

\begin{verbatim}
$ head file -n 20
\end{verbatim}
\subsubsection*{tail}
\label{sec:org7e4d07c}
\begin{notes}
	Same as head but for the last 10 lines
	again -n will allow you to specify the amount of lines
\end{notes}

\begin{verbatim}
$ tail file -n 20
\end{verbatim}
