presentations/intro-to/the-unix-commandline.org
*** chmod
#+begin_notes
Change the file permissions. In linux files do not need extensions. instead
attached to each and every file is a set of permissions. You saw them when we
discussed ln. chmod changes those permissions. if you want to add a permission
then do + followed by r w x or remove them replace the + with a minus

Notice the different groups. the first symbol is the type it can be d for
directory l for link or - for file
the first set of 3 is what root can do. root is the main user and they have free
reign over the system. the second triple is the user permissions and the last one
is other peoples permissions
#+end_notes

#+begin_src bash
$ ls -l
-rw-rw-r-- ... file
$ chmod +x file
$ ls -l
-rwxrwxr-x ... file

$ chmod -rwx file
---------- ... file
#+end_src
** Transforming text
*** echo
#+begin_notes
shell print statement. It will print out a string of text. If you use
#+end_notes

#+begin_src bash
echo "a string"
a string
echo -e "this is a \n multiline string "
this is a
 multiline string
echo $VAR
# contense of VAR
#+end_src
*** grep
#+begin_notes
grep is a commandline regex matcher. It takes the arguments of a string (usually
with a regular expression) and a file.
some useful flags are -v which returns all of the lines that do not match -i
which ignores case and -c which counts the number of occurrences
#+end_notes

#+begin_src bash
$ cat file
fox
fax
fex
$ grep "fox" file
fox
$ grep "f.x" file

$ grep "fox" file -v
fax
fex
#+end_src
*** sed
#+begin_notes
sed is used to make substutions in text it takes the arguments of a command and
a file It has a little bit of a werid syntax so bear with me

in the string we start it with s this tells sed we are performing a substitution
we then provide it with a regex this is what will be substituted then you
provide the substitution. There is more syntax here but these are the basics

Now by default sed will only perform 1 substitution to tell it to replace all
you need to add g to the end this is called a flag

You can add the -i flag to change the file in place. if you add an argument to
it will create a backup of the file you are about to change
#+end_notes

#+begin_src bash
$ sed 's/REGEX/REPLACEMENT/FLAG' file

$ cat file
the fox did fox things to say fox you to big fox
$ sed 's/fox/wolf/' file
the wolf did fox things to say fox you to big fox

$ sed 's/fox/wolf/g' file
the wolf did wolf things to say wolf you to big wolf

$ sed 's/fox/wolf/g' file -i

$ cat file
the wolf did wolf things to say wolf you to big wolf
#+end_src

*** awk
#+begin_notes
awk is a swiss a text processing swiss army knife. it is its own language and
can pretty much replace all of the text processing commands. Now do I recommend
that? welll probably not. but its pretty cool. Now that being said most people
use awk to get out column's of data.

awk programs are constructed from a set of pattern and actions.

Awk first splits your files into lines and then into fields and then store those
fields in variables. they are denoted by a $ sign and the number of the field
note that $0 holds the whole file and $NF holds the last. If you want the first
field you would call $1 second so on

Now this can be useful but it may be more useful for a csv file. To change the
field seperatior you need to use the -F flag

In this example we are restructuring a csv to make it into a nicer format
#+end_notes

#+begin_src awk
some-pattern { some action }
another-pattern { a different action }
{ all lines match this action }

$0 ~ /some regex/ {
    print $1, $2 # for example
}

$1 == 18 {
    print $2, $1
}
#+end_src

#+begin_src bash
$ cat file
this file is has space seperated words
it has multiple lines
$ awk '{print $0}' file # we just made a slower less convenient cat!
this file is has space seperated words
$ awk '{print $1}' file # print the first element of each line
this
it
$ cat file.csv
name,age,job
Jeet,18,Being a Nerd

$ awk -F, '{printf("name:%s job:%s age:%s", $1, $3, $2)}' file.csv
name:Jeet job:Being a nerd age:18
#+end_src

*** sort
#+begin_notes
sort sorts a file. You can tell it to sort using a numeric sort -n a dictionary
sort (whch is also known as alphanumeric) as well as others
#+end_notes

#+begin_src bash
$ cat file-o-numbers
1
15
2
30
$ sort -n file-o-numbers
1
2
15
30
#+end_src
*** uniq
#+begin_notes
uniq removes dupicates from a file. Nothing really more to say
#+end_notes

#+begin_src
$ cat file
this
this
has
some
some
duplicates

$ uniq file
this
has
some
duplicates
#+end_src
*** wc
#+begin_notes
wc stands for word count. it will count the amount of lines words and bytes in
that order you can add -l flag to get the line count -w to get the word count or
-c for the byte count
#+end_notes

#+begin_src bash
$ cat file
line 1
line 2
line 3

$ wc file
3 6 24
$ wc -l
3
$ wc -w
6
$ wc -c
24
#+end_src
** User management
*** sudo
#+begin_notes
sudo stands for super user do. it allows you to execute commands as another user
(usually root). This is used all over the place as root is the only one allowed
to do certain things like installing system programs and changing files outside
of your home directory. sudo allows you to execute one command like that as a
sort of security mesure.
#+end_notes

#+begin_src bash
$ apt update
Permission denied
$ sudo apt update
# works
#+end_src
*** w
#+begin_notes
w shows you who is logged on and what they are doing
it will give you information on who is logged on where there are logged in from
and what they are doing.
#+end_notes

#+begin_src bash
$ w

 02:26:18 up  8:52,  2 users,  load average: 0.94, 1.29, 1.15
USER     TTY      FROM             LOGIN@   IDLE   JCPU   PCPU WHAT
jeet     :1       :1               17:34   ?xdm?   4:07m  0.01s /usr/libexec/gdm-x-session --run-script env GNOME_SHELL_SESSION_MODE=pop /usr/bin/gnome-session --session=pop
root     tty4     -                02:24    1:52   0.02s  0.01s -bash
#+end_src

** Process management
*** pgrep
#+begin_notes
pgrep will give you the process id's that match the a string they give you
#+end_notes
#+begin_src bash
$ pgrep emacs
23878
23878

$ pgrep firefox
6997
#+end_src
*** pkill
#+begin_notes
pkill kills the process or processs given to it. You can give it a process id or
the string you were going to give to pgrep anyway. use the -9 flag to kill the
process instantly
#+end_notes

#+begin_src bash
$ pkill emacs # waits for emacs to finish

$ pkill 23878 -9 # kills emacs instantly

#+end_src
*** htop
#+begin_notes
htop is probably not installed by default but it makes all of this manual work
interactive. Its better if I show you
#+end_notes

#+begin_src
$ htop
#+end_src
** Others
*** man
#+begin_notes
man is the inbuilt unix documentation. I did not need the internet to find out
about all of the commands I just bored you with. I just typed in man command and
it gave me everything the command can do in a semi nice to read format

man uses a pager by default so you can scroll and have a look at your leasure
#+end_notes

#+begin_src bash
$ man command
#+end_src
** Honorable mentions
- nc :: The networking swiss army knife
- calc :: like awk for numbers
- lp :: Have you ever needed too print something? well now you can on the
  command line!
- less :: Read files at your pleasure

* Pipes
