presentations/intro-to/the-unix-commandline.tex

\section*{Pipes}
\label{sec:org9b6c5c5}
\subsection*{Output redirection}
\label{sec:org21f893d}
\begin{notes}
	for the most part we have just been outputing all of our data onto the
	proverbial floor and we should really be putting it into a file. we can use
	output redirection to put the stdout into a file

	Nothing will be outputed onto the screen and all of the output will be put
	into the file. This is great. but now we have over written the file.. maybe we
	just want to append to the file.

	There are also some special places you can redirect to and some special outputs
	you can get.

	/dev/null is a black hole. when you send data there it will never be saved this
	is useful when you have a program that sends out a lot of error output you don't
	need. This is also a good time to mention that errors are sent out on a
	different stream of text. called stderr You can redirect the errors from it by
	simply adding a 2 in front
\end{notes}

\begin{verbatim}
$ cat file1 file2 > file1+file2

$ cat non-existant-file 2> /dev/null # no errors and no output
\end{verbatim}

\subsection*{Output appendation?}
\label{sec:org89ed338}
\begin{notes}
	To append we use double the ammount of more than signs. This is usefull for when
	you have a log file. Just be careful to make sure the amount of more than signs
	are correct
\end{notes}

\begin{verbatim}
$ some-output >> some-log-file
\end{verbatim}

\subsection*{Pipes}
\label{sec:orgbe6df64}
\begin{notes}
	Pipes are a very powerful concept in unix. It allows you to build bigger
	programs from smaller ones. The way it works is you chain the std output of one
	command into the std input of the next. the command will do its work and pass it
	onto the next. Whenerver you use a print statement in python you are outputing
	to std output and its what these programs are doing. Lets take an example. I
	have a csv full of names and ages. I want to get the age of all the people who
	are over the age of 18 and have a name beginning with J

	Now this example is not all to revolutinary but you can create very complex
	programms from simpler blocks. This way of thinking can help you frame code
	problems in a different way. As a set of transformations of an input instead of
	a set of instructions. This is actually a tennant of functional programming
\end{notes}

\begin{verbatim}
$ cat file
Jeet,18
Jen,19
Mark,17

$ cat file | grep -i "j." | awk -F, '$2 >= 18 {print "name:", $1, "age:", $2}'
name: Jeet age: 18
name: Jen age: 19
\end{verbatim}

\subsection*{An actual example}
\label{sec:orgfe2c9e5}
\begin{notes}
	This is an actual script I wrote to solve my needs. \textbf{show gh gist list}
	I use the github cli to handle some thinsga and github gists are just one of
	them. For the purposes of today they are just small code files with a hash
	attactched to them and to edit them you need to paste in the hash. I could do
	that manually but thats a pain so I automated

	\textbf{walk through the script}
\end{notes}

\begin{verbatim}
gist_list=$(gh gist list)
gist_to_find=$(echo "$gist_list" | awk '{print $2}' | fzf --layout=reverse)

gh gist edit $(echo "$gist_list" | grep $gist_to_find | awk '{print $1}')

\end{verbatim}
\section*{What to do from here?}
\label{sec:org0a0b3a8}
\begin{notes}
	Well now you have this introduction you need to use it.
	You can practice with the linux environments I hope you now have. Have a play
	with it and have fun with it. Wrote memorisation like this will probably not
	help but apply these skills will help you a lot
\end{notes}

\section*{Any Questions?}
\label{sec:orgedcfefc}
\end{document}
